#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
    ofBackground(0, 0, 0);
}

//--------------------------------------------------------------
void ofApp::update(){

}

//--------------------------------------------------------------
void ofApp::draw(){
    
    // 練習9-6a =======================================
    ofSetColor(255, 255, 255);
    ofSetLineWidth(1);
    ofDrawLine(  0, 400, 800, 400);     // 横線
    ofDrawLine(400,   0, 400, 800);     // 縦線
    
    // 練習9-6a =======================================
    for (int x = -400 ; x < 400 ; x++) {    // 中心が0なので-400〜400
        ofSetColor(255, 0, 0);

        int y = 2 * x + 50;     // 与えられた式でYを求める　y=2x+50
        
        // X軸を+400補正
        // Y軸を+400補正、正負を反転させる
        ofDrawCircle(x + 400, -y + 400, 2);
        
//        // 補正をしないで描画してみる
//        ofSetColor(0, 255, 0);
//        ofDrawCircle(x, y, 2);
    }
}

//--------------------------------------------------------------
//void ofApp::exit(){
//
//}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
//void ofApp::mouseScrolled(int x, int y, float scrollX, float scrollY){
//
//}

//--------------------------------------------------------------
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
